//week11_7_pacman_part6_show_walls
//修改自11_6_pacman_part5_wall_turning_point
//小精靈張嘴(在動)爾且嘴巴的方向dir會轉動
void setup(){
 size(600,600); 
}
int x=300-15,y=300-15,dx=0,dy=0,dir=0;//direction
float m=0, dm=0.05;//嘴巴大小mouth, 嘴巴改變量diff of m
boolean[][]bean_eaten=new boolean[20][20];
int[][]walls={
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,1,0},
  {0,1,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
  {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
};
void draw(){
 background(0);
 boolean canMoveX=true,canMoveY=true;
 for(int i=0;i<20;i++){//左手i對應y座標
  for(int j=0;j<20;j++){ //右手j對應x座標
    if(walls[i][j]==1){
     fill(255);//白色的豆子
     rect(j*30,i*30,30,30);
     if(j*30 <= x+dx*15 && x+dx*15 <= j*30+30 && i*30 <= y && y <= i*30+30 )canMoveX=false;
     if(j*30 <= x && x <= j*30+30 && i*30 <= y+dy*15 && y+dy*15 <= i*30+30 )canMoveY=false;
    }
     else if(bean_eaten[i][j]==false){
     fill(255);
     ellipse(15+j*30,15+i*30,5,5);
     if(dist(x,y,15+j*30,15+i*30)<15)bean_eaten[i][j]=true;
    }
  }
 }
 
 fill(255,255,0);//黃色的
 float m0=dir*PI/2;//幾個半PI
 arc(x,y,30,30,m0+m,m0+PI*2-m);//弧度
 if(x+dx >= 15 && x+dx <= 600-15&&canMoveX)x+=dx;//改變座標(不超過四面的牆)
 if(y+dy >= 15 && y+dy <= 600-15&&canMoveY)y+=dy;//改變座標(不超過四面的牆)
 if((x-15)%30==0 && (y-15)%30==0){
   if(next==2){dx=-1;dy=0;dir=2;}//dir:2 向左PI
   if(next==0){dx=+1;dy=0;dir=0;}//dir:0 向右0度
   if(next==3){dx=0;dy=-1;dir=3;}//dir:3向上PI*1.5
   if(next==1){dx=0;dy=+1;dir=1;}//dir:1向下PI/2
   next=-1;//沒有要轉動
 }
 
 if(m>=1 || m<0)dm=-dm;//正負倒過來
 m+=dm;
}
int next=-1;//一開始沒有要轉動
void keyPressed(){//按方向鍵會決定next要怎麼做
 if(keyCode==LEFT)next=2;
 if(keyCode==RIGHT)next=0;
 if(keyCode==UP)next=3;
 if(keyCode==DOWN)next=1;
}
